Kevin Galvan Serrano

In [41]:
#importing pandas
import pandas as pd

In [42]:
#loading in dataframe from HW4
df=pd.read_csv('employees.csv')

In [43]:
#printing shape and data
print(f'\n\nShape : {data.shape}')
print(f'\nDescriptive Stats :\n{data.describe}')

Shape : (14, 8)

Descriptive Stats :
<bound method NDFrame.describe of     EMPNO   ENAME        JOB   MGR   HIREDATE   SAL    COMM  DEPTNO
0    7839    KING  PRESIDENT    -   17-Nov-81  5000     NaN      10
1    7698   BLAKE    MANAGER  7839   1-May-81  2850     NaN      30
2    7782   CLARK    MANAGER  7839   9-Jun-81  2450     NaN      10
3    7566   JONES    MANAGER  7839   2-Apr-81  2975     NaN      20
4    7788   SCOTT    ANALYST  7566  19-Apr-87  3000     NaN      20
5    7902    FORD    ANALYST  7566   3-Dec-81  3000     NaN      20
6    7369   SMITH      CLERK  7902  17-Dec-80   800     NaN      20
7    7499   ALLEN   SALESMAN  7698  20-Feb-81  1600   300.0      30
8    7521    WARD   SALESMAN  7698  22-Feb-81  1250   500.0      30
9    7654  MARTIN   SALESMAN  7698  28-Sep-81  1250  1400.0      30
10   7844  TURNER   SALESMAN  7698   8-Sep-81  1500     0.0      30
11   7876   ADAMS      CLERK  7788  23-May-87  1100     NaN      20
12   7900   JAMES      CLERK  7698   3-Dec-81   950     NaN      30
13   7934  MILLER      CLERK  7782  23-Jan-82  1300     NaN      10>

In [44]:
#renaming data frame
df.rename(columns={'ENAME':'Employee_name'},inplace=True)

In [45]:
#creating new dataframe
new_df=df.iloc[:,1:]

In [46]:
#printing head of new dataframe
print(new_df.head())

  Employee_name        JOB   MGR   HIREDATE   SAL  COMM  DEPTNO
0          KING  PRESIDENT    -   17-Nov-81  5000   NaN      10
1         BLAKE    MANAGER  7839   1-May-81  2850   NaN      30
2         CLARK    MANAGER  7839   9-Jun-81  2450   NaN      10
3         JONES    MANAGER  7839   2-Apr-81  2975   NaN      20
4         SCOTT    ANALYST  7566  19-Apr-87  3000   NaN      20